create table question (
	id int PRIMARY KEY auto_increment,
	content varchar(30),
	A_answer VARCHAR(20),
	B_answer VARCHAR(20),
	A_type char(1),
	B_type char(1),
	type char(2)
);

insert INTO question(content,A_answer,B_answer,A_type,B_type,type) 
VALUES
("当你要外出一整天，你会","计划你要做什么和在什么时候做","说去就去","J","P","JP"),
("你认为自己是一个","较为随兴所至的人","较为有条理的人","P","J","JP"),
("假如你是一位老师，你会选教","以事实为主的课程","涉及理论的课程","S","N","SN"),
("你通常","与人容易混熟","比较沉静或矜持","E","I","EI"),
("一般来说，你和哪些人比较合得来?","富于想象力的人","现实的人","N","S","SN"),
("你是否经常让","你的情感支配你的理智","你的理智主宰你的情感","F","T","TF"),
("处理许多事情上，你会喜欢","凭兴所至行事","按照计划行事","P","J","JP"),
("你是否","容易让人了解","难于让人了解","E","I","EI"),
("按照程序表做事","合你心意","令你感到束缚","J","P","JP"),
("当你有一份特别的任务，你会喜欢","开始前小心组织计划","边做边找须做什么","J","P","JP"),
("在大多数情况下，你会选择","顺其自然","按程序表做事","P","J","JP"),
("大多数人会说你是一个","重视自我隐私的人","非常坦率开放的人","E","I","EI"),
("你宁愿被人认为是一个","实事求是的人","机灵的人","S","N","SN"),
("在一大群人当中，通常是","你介绍大家认识","别人介绍你","E","I","EI"),
("你会跟哪些人做朋友?","常提出新注意的","脚踏实地的","N","S","SN"),
("你倾向","重视感情多于逻辑","重视逻辑多于感情","F","T","TF"),
("你比较喜欢","坐观事情发展才作计划","很早就作计划","P","J","PJ"),
("你喜欢花很多的时间","一个人独处","合别人在一起","I","E","EI"),
("与很多人一起会","令你活力培增","常常令你心力憔悴","E","I","EI"),
("你比较喜欢","很早便把约会、社交聚集等事情安排妥当","无拘无束，看当时有什么好玩就做什么","J","P","JP"),
("计划一个旅程时，你较喜欢","大部分的时间都是跟当天的感觉行事","事先知道大部分的日子会做什么","P","J","JP"),
("在社交聚会中，你","有时感到郁闷","常常乐在其中","I","E","EI"),
("你通常","和别人容易混熟","趋向自处一隅","E","I","EI"),
("哪些人会更吸引你?","一个思想敏捷及非常聪颖的人","实事求是，具丰富常识的人","N","S","SN"),
("在日常工作中，你会","颇为喜欢处理迫使你分秒必争的突发","通常预先计划，以免要在压力下工作","P","J","JP"),
("你认为别人一般","要花很长时间才认识你","用很短的时间便认识你","I","E","EI")
;

insert INTO question(A_answer,B_answer,A_type,B_type,type) 
VALUES
("注重隐私","坦率开放","I","E","EI"),
("预先安排的","无计划的","J","P","JP"),
("抽象","具体","N","S","SN"),
("温柔","坚定","F","T","TF"),
("恩考","感受","T","F","TF"),
("事实","意念","S","N","SN"),
("冲动","决定","P","J","JP"),
("热衷","文静","E","I","EI"),
("文静","外向","I","E","EI"),
("有系统","随意","J","P","JP"),
("理论","肯定","N","S","SN"),
("敏感","公正","F","T","TF"),
("令人信服","感人的","T","F","TF"),
("声明","概念","S","N","SN"),
("不受约束","预先安排","P","J","PJ"),
("矜持","健谈","I","E","EI"),
("有条不素","不拘小节","J","P","JP"),
("意念","实况","N","S","SN"),
("同情怜悯","远见","F","T","TF"),
("利益","祝福","T","F","TF"),
("务实的","理论的","S","N","SN"),
("朋友不多","朋友众多","E","I","EI"),
("有系统","即兴","J","P","JP"),
("富想象的","以事论事","N","S","SN"),
("亲切的","客观的","F","T","TF"),
("客观的","热情的","T","F","TF"),
("建造","发明","S","N","SN"),
("文静","爱合群","E","I","EI"),
("理论","事实","N","S","SN"),
("富同情","合逻辑","F","T","TF"),
("具分析力","多愁善感","T","F","TF"),
("合情合理","令人着迷","S","N","SN")
;

UPDATE question SET content = "在下列的一对词语中，哪一个词语更合你心意？" WHERE id between 27 AND 58;

insert INTO question(content,A_answer,B_answer,A_type,B_type,type) 
VALUES
("当你要在一个星期内完成一个大项目，你在开始的时候会","把要做的不同工作依次列出","马上动工","J","P","JP"),
("在社交场合中，你经常会感到","与某些人很难打开话匣儿和保持对话，或是","与多数人都能从容地长谈","I","E","EI"),
("要做许多人也做的事，你比较喜欢","按照一般认可的方法去做","构想一个自己的想法","S","N","SN"),
("你刚认识的朋友能否说出你的兴趣?","马上可以","要待他们真正了解你之后才可以","E","I","EI"),
("你通常较喜欢的科目是","讲授概念和原则的","讲授事实和数据的","N","S","SN"),
("哪个是较高的赞誉，或称许为?","一贯感性的人","一贯理性的人","F","T","TF"),
("你认为按照程序表做事","有时是需要的，但一般来说你不大喜欢这样做","大多数情况下是有帮助而且是你喜欢做的","P","J","JP"),
("和一群人在一起，你通常会选","跟你很熟悉的个别人谈话","参与大伙的谈话","I","E","EI"),
("在社交聚会上，你会","是说话很多的一个","让别人多说话","E","I","EI"),
("把周末期间要完成的事列成清单，这个主意会","合你意","使你提不起劲","J","P","JP"),
("哪个是较高的赞誉，或称许为","能干的","富有同情心","T","F","TF"),
("你通常喜欢","事先安排你的社交约会","随兴之所至做事","J","P","JP"),
("总的说来，要做一个大型作业时，你会选","边做边想该做什么","首先把工作按步细分","P","J","JP"),
("你能否滔滔不绝地与人聊天","只限于跟你有共同兴趣的人","几乎跟任何人都可以","I","E","EI"),
("你会","跟随一些证明有效的方法","分析还有什么毛病，及针对尚未解决的难题","S","N","SN"),
("为乐趣而阅读时，你会","喜欢奇特或创新的表达方式","喜欢作者直话直说","N","S","SN"),
("你宁愿替哪一类上司(或者老师)工作?","天性淳良，但常常前后不一的","言词尖锐但永远合乎逻辑的","F","T","TF"),
("你做事多数是","按当天心情去做","照拟好的程序表去做","P","J","JP"),
("你是否","可以和任何人按需求从容地交谈","只是对某些人或在某种情况下才可以畅所欲言","E","I","EI"),
("要作决定时，你认为比较重要的是","据事实衡量","考虑他人的感受和意见","T","F","TF")
;

insert INTO question(A_answer,B_answer,A_type,B_type,type) 
VALUES
("想象的","真实的","N","S","SN"),
("仁慈慷慨的","意志坚定的","F","T","TF"),
("公正的","有关怀心","T","F","TF"),
("制作","设计","S","N","SN"),
("可能性","必然性","N","S","SN"),
("温柔","力量","F","T","TF"),
("实际","多愁善感","T","F","TF"),
("制造","创造","S","N","SN"),
("新颖的","已知的","N","S","SN"),
("同情","分析","F","T","TF"),
("坚持己见","温柔有爱心","T","F","TF"),
("具体的","抽象的","S","N","SN"),
("全心投入","有决心的","F","T","TF"),
("能干","仁慈","T","F","TF"),
("实际","创新","S","N","SN")
;

UPDATE question SET content = "在下列的一对词语中，哪一个词语更合你心意？" WHERE id between 79 AND 93;
